app/Models/Admin_model.php

    public function loaddata()
    {
        $builder=$this->db->table('category');
        $builder->select('cat_id,name,image');
        $result=$builder->get();
---
SELECT `cat_id`, `name`, `image`
FROM `category`

    public function pincode_list()
    {
        $builder=$this->db->table('pincode_list');
        $builder->select('pincode');
        $result=$builder->get();
---
SELECT `pincode`
FROM `pincode_list`

    public function order_detail()
    {
        $builder=$this->db->table('finalorder');
        $builder->select('*');
        $result=$builder->get();
---
SELECT *
FROM `finalorder`

    public function update_status($status,$order_id)
    {
        $builder=$this->db->table('finalorder');
        $builder->set('status',$status);
        $builder->where('order_id',$order_id);
        $builder->update();
---
UPDATE `finalorder` SET `status` = 'not delivered'
WHERE `order_id` = '1'