app/Models/Id_model.php

SELECT `user`
FROM `serial_no`
 LIMIT 1
---
    public function getuserid()
    {
        $builder=$this->db->table('serial_no');
        $builder->select('user');        //$row = $this->db->select("*")->limit(1)->order_by('id',"DESC")->get("table name")->row();
        $result=$builder->get();

UPDATE `serial_no` SET `user` = ''
WHERE `id` = 'ID-SERIAL'
AND 2 IS NULL
---
    public function update_userid($user,$id)
    {
        $builder=$this->db->table('serial_no');
        $builder->set('user',$user);
        $builder->where('id',$id);
        $builder->update();

SELECT `cat`
FROM `serial_no`
---
    public function getcatid()
    {
        $builder=$this->db->table('serial_no');
        $builder->select('cat');        //$row = $this->db->select("*")->limit(1)->order_by('id',"DESC")->get("table name")->row();
        $result=$builder->get();

UPDATE `serial_no` SET `cat` = 1
WHERE `id` = 'IDSERIAL'
---
    public function update_catid($cat,$id)
    {
        $builder=$this->db->table('serial_no');
        $builder->set('cat',$cat);
        $builder->where('id',$id);
        $builder->update();

SELECT `trans`
FROM `serial_no`
---
    public function gettransid()
    {
        $builder=$this->db->table('serial_no');
        $builder->select('trans');        //$row = $this->db->select("*")->limit(1)->order_by('id',"DESC")->get("table name")->row();
        $result=$builder->get();