app/Models/Id_model.php

SELECT `user`
FROM `serial`
 LIMIT 1
---
    public function getuserid()
    {
        $builder=$this->db->table('serial');
        $builder->select('user')->limit(1);        //$row = $this->db->select("*")->limit(1)->order_by('id',"DESC")->get("table name")->row();
        $result=$builder->get();