app/Models/Login_model.php

    public function check($email)
    {
        $builder= $this->db->table('user');
        $builder->select('user_id,pass');
        $builder->where('email', $email);
        $result=$builder->get();
---
SELECT `user_id`, `pass`
FROM `user`
WHERE `email` = 'abc@gmail.com'