app/Models/Signup_model.php

INSERT INTO `user` (`user_id`, `name`, `mobile`, `email`, `addr`, `pass`) VALUES ('ID-20231124-124613-1', 'rishad', '1234567890', 'zxa@gmail.com', 'abcd', '$2y$10$A2Pm1GViwzAuAdvaj2UgbOLf5wpaBwBr7Z/bjzA3OyUGGViwXRgWG')
---
    public function savedata($data)
    {
        $builder= $this->db->table('user');
        $builder->insert($data);