app/Models/User_model.php

    public function get_user($user_id)
    {
        $builder=$this->db->table('user');
        $builder->select('*');
        $builder->where('user_id',$user_id);
        $result=$builder->get();
---
SELECT *
FROM `user`
WHERE `user_id` = 'ID-20231126-094149-2'

    public function get_category()
    {
        $builder=$this->db->table('category');
        $builder->select('*');
        $result=$builder->get();
---
SELECT *
FROM `category`

    public function get_product($cat_id)
    {
        $builder=$this->db->table('product');
        $builder->select('*');
        $builder->where('cat_id',$cat_id);
        $result=$builder->get();
---
SELECT *
FROM `product`
WHERE `cat_id` = 'CAT-20231130-121257-2'

    public function prod_detail($prod_id)
    {
        $builder=$this->db->table('product');
        $builder->select('*');
        $builder->where('prod_id',$prod_id);
        $result=$builder->get();
---
SELECT *
FROM `product`
WHERE `prod_id` = 'PROD-20231130-123248-2'

    public function addto_cart($data)
    {
        $builder=$this->db->table('trans');
        $builder->insert($data);
---
INSERT INTO `trans` (`trans_id`, `prod_id`, `user_id`, `qty`, `price`) VALUES ('TRANS-20231201-115244-0', 'PROD-20231130-123248-2', 'ID-20231126-094149-2', '1', '11')

    public function cart_items($user_id)
    {
        $builder=$this->db->table('trans');
        $builder->select('*');
        $builder->where('user_id',$user_id);
        $result=$builder->get();
---
SELECT *
FROM `trans`
WHERE `user_id` = 'ID-20231126-094149-2'

    public function get_item_detail($prod_id)
    {
        $builder=$this->db->table('product');
        $builder->select('name,sprice,image,unit');
        $builder->where('prod_id',$prod_id);
        $result=$builder->get();
---
SELECT `name`, `sprice`, `image`, `unit`
FROM `product`
WHERE `prod_id` = 'PROD-20231130-123248-2'

    public function update_cart_qty($trans_id,$qty)
    {
        $builder=$this->db->table('trans');
        $builder->set('qty',$qty);
        $builder->where('trans_id',$trans_id);
        $builder->update();
---
UPDATE `trans` SET `qty` = '3'
WHERE `trans_id` = 'TRANS-20231201-115244-0'

    public function user_addr($user_id)
    {
        $builder=$this->db->table('user');
        $builder->select('addr');
        $builder->where('user_id',$user_id);
        $result=$builder->get();
---
SELECT `addr`
FROM `user`
WHERE `user_id` = 'ID-20231126-094149-2'